name: "FNN"
layer {
  name: "a9a"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  data_param {
    source: "examples/a9a/a9a_train_lmdb"
    batch_size: 50
    backend: LMDB
  }
}
layer {
  name: "a9a"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  data_param {
    source: "examples/a9a/a9a_test_lmdb"
    batch_size: 16281
    backend: LMDB
  }
}
layer {
  name: "fc6_BDK_1"
  type: "InnerProduct"
  bottom: "data"
  top: "fc6_BDK_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
  }
}
layer {
  name: "loss_1"
  type: "SoftmaxWithLoss"
  bottom: "fc6_BDK_1"
  bottom: "label"
  top: "loss_1"
  include {
    phase: TRAIN
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "fc6_BDK_1"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc6_BDK_1"
  bottom: "label"
  top: "loss"
  include {
    phase: TEST
  }
}
